app/controllers/admin/authors_controller.rb

      def set_author!
        @author = Author.find params[:id]
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]