app/controllers/admin/users_controller.rb

UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", 3], ["updated_at", "2021-11-11 07:24:33.865366"], ["id", 1]]
---
    def update
      if @user.update user_params

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_user!
      @user = User.find params[:id]