app/views/books/_book.html.erb

SELECT "book_groups".* FROM "book_groups" WHERE "book_groups"."book_id" = $1  [["book_id", 13]]
SELECT "groups".* FROM "groups" INNER JOIN "book_groups" ON "groups"."id" = "book_groups"."group_id" WHERE "book_groups"."book_id" = $1  [["book_id", 13]]
---
            <div class="my-2">
                <%= render file: "groups/_groupcard.html.erb", :locals=[book.groups] %>