app/views/books/index.html.erb

SELECT "book_groups".* FROM "book_groups" WHERE "book_groups"."book_id" IN ($1, $2)  [["book_id", 14], ["book_id", 13]]
SELECT "groups".* FROM "groups"
---
        <div class="my-2 md-4">
          <%= render Group.all %>