app/controllers/books_controller.rb

    def index
        @pagy, @books = pagy Book.with_attached_cover.all_by_groups(params[:group_ids])
        # with_attached_cover.includes(:book_groups, :groups).order(created_at: :desc)
        @searched_group = Group.where(id: params[:group_ids]).pluck(:title)
---
SELECT "groups"."title" FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]

    def create
        @book = current_user.books.build book_params

        if @book.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Nice book"], ["body", "Interesting"], ["created_at", "2021-11-15 15:58:12.828531"], ["updated_at", "2021-11-15 15:58:12.828531"], ["user_id", 3]]

    def show
        @book = Book.find_by id: params[:id]
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]

    def update
        if @book.update book_params
---
UPDATE "books" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["title", "The Murder"], ["body", "Some book"], ["updated_at", "2021-11-17 00:42:37.266245"], ["id", 43]]

    def set_book!
        @book = Book.find params[:id]
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]

    def add_authors
        authors = params[:book][:author].chomp.split(",")
        authors.each do |name|
            if Author.where(name: name).exists?
                @author = Author.where(name: name)
            else
                @author = Author.new(name: name)
            end
            @author.books << @book
            @author.save
---
SELECT 1 AS one FROM "authors" WHERE "authors"."name" = $1 LIMIT $2  [["name", "JRR Tolkien"], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."name" = $1 LIMIT $2  [["name", "JRR Tolkien"], ["LIMIT", 1]]
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Mykola Admin"], ["created_at", "2021-11-15 18:09:34.695349"], ["updated_at", "2021-11-15 18:09:34.695349"]]
UPDATE "authors" SET "name" = $1, "updated_at" = $2 WHERE "authors"."id" = $3  [["name", "Author Name"], ["updated_at", "2021-11-15 23:06:12.550154"], ["id", 10]]
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "JRR Tolkien"], ["created_at", "2021-11-15 18:38:29.804753"], ["updated_at", "2021-11-15 18:38:29.804753"]]