app/controllers/books_controller.rb

SELECT "authors".* FROM "authors"
---
    def update
        if @book.update permitted_attributes(@book)
            if !params[:book][:author].empty?

SELECT "authors".* FROM "authors"
---
    def add_authors
        authors = params[:book][:author].chomp.split(",")
        authors.each do |author|