app/controllers/books_controller.rb

SELECT "book_groups".* FROM "book_groups" WHERE "book_groups"."book_id" IN ($1, $2)  [["book_id", 14], ["book_id", 13]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" IN ($1, $2)  [["id", 6], ["id", 9]]
---
    def index
        @pagy, @books = pagy Book.includes(:cover, :book_groups, :groups).order(created_at: :desc)

UPDATE "books" SET "updated_at" = $1 WHERE "books"."id" = $2  [["updated_at", "2021-11-15 15:58:12.852350"], ["id", 23]]
---
    def update
        if @book.update book_params

SELECT "book_groups".* FROM "book_groups" WHERE "book_groups"."book_id" = $1  [["book_id", 24]]
---
    def fetch_groups
        @groups = Group.all