app/controllers/sessions_controller.rb

    def create
      user = User.find_by email: params[:email]
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mykola@admin.com"], ["LIMIT", 1]]

    def set_user
      @user = User.find_by email: params[:email]
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mykola@admin.com"], ["LIMIT", 1]]