app/controllers/concerns/authentication.rb

      def user_with_session
        User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def user_with_token
        user = User.find_by(id: cookies.encrypted[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]